{
  "clContentInfo": [
    {
      "title": "Email",
      "value": "luojinxuice@gmail.com",
      "logo": "/email.svg"
    },
    {
      "title": "Phone",
      "value": "+447724310483",
      "logo": "/phone.svg"
    },
    {
      "title": "Location",
      "value": "London, United Kingdom",
      "logo": "/location.svg"
    },
    {
      "title": "LinkedIn",
      "value": "linkedin.com/in/luojinxu",
      "logo": "/linkedin.svg"
    }
  ],
  "introduction": "I am writing to express my keen interest in the Full-Stack Engineer position at Revolution Technology . With over four years of experience building scalable web applications using React.js, Node.js, and TypeScript, I am eager to bring my expertise and passion for innovation to your team.",
  "applicant": {
    "name": "Jinxu Luo",
    "title": "Full-Stack Developer",
    "email": "luojinxuice@gmail.com",
    "phone": "+447724310483",
    "location": "London"
  },
  "recipient": {
    "name": "Hiring Manager",
    "company": " Revolution Technology",
    "date": "2025-01-22"
  },
  "projects": [
    {
      "title": "Cross-border Paperless Trade Platform",
      "description": "I led the development of a blockchain-based cross-border paperless trade platform that secured a 20M CNY government grant."
    },
    {
      "title": "Legacy System Modernization:",
      "description": "I spearheaded the migration of a legacy system to a modern Vue 3 architecture, reducing load times by 30% while ensuring compliance with stringent security standards"
    },
    {
      "title": "Chatbot Development",
      "description": "Built an internal Q&A chatbot using ChatGPT API, implementing real-time streaming for seamless interactions and improving team productivity."
    }
  ],
  "skills": "Beyond technical expertise, I take pride in fostering collaboration and leadership. At Linklogis, I mentored junior developers, standardized coding practices, and developed tools to streamline workflows, enhancing overall team efficiency. ",
  "missionStatement": "Your focus on leveraging AI, automation, and LLMs to build a game-changing SaaS platform aligns perfectly with my interests and skill set. I am particularly excited about contributing to your roadmap of cutting-edge features and shaping the vision and strategy of the product.",
  "closing": "Thank you for considering my application. I would welcome the opportunity to discuss how I can contribute to your team."
}