{
    "clContentInfo": [
        {
            "title": "Email",
            "value": "luojinxuice@gmail.com",
            "logo": "/email.svg"
        },
        {
            "title": "Phone",
            "value": "+447724310483",
            "logo": "/phone.svg"
        },
        {
            "title": "Location",
            "value": "London, United Kingdom",
            "logo": "/location.svg"
        },
        {
            "title": "LinkedIn",
            "value": "linkedin.com/in/luojinxu",
            "logo": "/linkedin.svg"
        }
    ],
    "introduction": "I am writing to express my interest in the FullStack Engineer - AI Platforms position at Contentful. With four years of experience in full-stack development and a proven track record of integrating AI-powered tools into scalable applications, I am excited about the opportunity to contribute to your mission of empowering teams with innovative AI solutions.",
    "applicant": {
        "name": "Jinxu Luo",
        "title": "Full-Stack Developer",
        "email": "luojinxuice@gmail.com",
        "phone": "+447724310483",
        "location": "London"
    },
    "recipient": {
        "name": "Hiring Manager",
        "company": "Contentful",
        "date": "2022-12-12"
    },
    "projects": [
        {
            "title": "Cloud IDE",
            "description": "Built an online cloud IDE platform using React, TypeScript, and Node.js, integrating intelligent plugins for real-time code
                                                                     completion and debugging while deploying the system on AWS for scalability, streamlining CI/CD pipelines."
        },
        {
            "title": "3D NFT Platform",
            "description": "Designed and deployed a platform with React and Golang, serving over 1,000 clients with a 96% satisfaction rate."
        },
        {
            "title": "ChatGPT-powered Q&A chatbot",
            "description": "Deployed a Q&A chatbot leveraging the ChatGPT API, using Node.js and Vue.js, implementing streaming output
                                                                               and seamless API integration, which has since become an essential productivity tool for the company."
        }
    ],
    "skills": "My technical skill set—including React, Node.js, PostgreSQL, and AWS—aligns closely with ${recipient.company}’s requirements. Beyond my technical abilities, I have a strong track record of collaborating with cross-functional teams, mentoring junior developers, and maintaining high standards of code quality in regulated environments.",
    "missionStatement": "Contentful’s mission to empower teams through innovative AI solutions aligns with my passion for building tools that drive efficiency. I look forward to contributing my skills in TypeScript, React, and Node.js to enhance your AI platform and support cross-functional innovation.",
    "closing": "Thank you for considering my application. I would welcome the opportunity to discuss how I can contribute to your team."
}
