{
  "clContentInfo": [
    {
      "title": "Email",
      "value": "luojinxuice@gmail.com",
      "logo": "/email.svg"
    },
    {
      "title": "Phone",
      "value": "+447724310483",
      "logo": "/phone.svg"
    },
    {
      "title": "Location",
      "value": "London, United Kingdom",
      "logo": "/location.svg"
    },
    {
      "title": "LinkedIn",
      "value": "linkedin.com/in/luojinxu",
      "logo": "/linkedin.svg"
    }
  ],
  "introduction": "I am excited to apply for the JavaScript Developer position at Create Digital Solutions. With over four years of experience in full-stack development, specializing in React, Node.js, and TypeScript, I have a proven track record of delivering scalable and client-focused digital solutions. I believe my technical expertise and passion for creating seamless user experiences align closely with your company’s commitment to delivering high-quality, tailored solutions.",
  "applicant": {
    "name": "Jinxu Luo",
    "title": "Full-Stack Developer",
    "email": "luojinxuice@gmail.com",
    "phone": "+447724310483",
    "location": "London"
  },
  "recipient": {
    "name": "Hiring Manager",
    "company": "Create Digital Solutions",
    "date": "2025-01-21"
  },
  "projects": [
    {
      "title": "Cloud IDE",
      "description": "Built a cloud IDE using React, Node.js, Typescript, Docker. Enhanced functionality by integrating intelligent plugins for code completion and debugging."
    },
    {
      "title": "3D NFT Platform",
      "description": "Designed and deployed a platform with React and Golang, serving over 1,000 clients with a 96% satisfaction rate."
    },
    {
      "title": "Cloud Deployments",
      "description": "Deployed containerized applications with AWS ECS and managed image repositories via ECR, streamlining CI/CD pipelines."
    }
  ],
  "skills": "My technical skill set—including React, Node.js, MangoDB, and AWS—aligns closely with your requirements. Beyond my technical abilities, I have a strong track record of collaborating with cross-functional teams, mentoring junior developers, and maintaining high standards of code quality in regulated environments.",
  "missionStatement": "What excites me most about this role is the opportunity to work on diverse client projects, from multinational accounts to smaller bespoke solutions, while contributing to in-house initiatives. I am particularly drawn to the collaborative and supportive team culture your company emphasizes, and I am eager to leverage my skills to help drive growth and innovation.",
  "closing": "Thank you for considering my application. I would welcome the opportunity to discuss how I can contribute to your team."
}
