{
  "clContentInfo": [
    {
      "title": "Email",
      "value": "luojinxuice@gmail.com",
      "logo": "/email.svg"
    },
    {
      "title": "Phone",
      "value": "+447724310483",
      "logo": "/phone.svg"
    },
    {
      "title": "Location",
      "value": "London, United Kingdom",
      "logo": "/location.svg"
    },
    {
      "title": "LinkedIn",
      "value": "linkedin.com/in/luojinxu",
      "logo": "/linkedin.svg"
    }
  ],
  "introduction": "I am writing to express my interest in the taff Software Engineer - International E-Commerce role within the International Product Group at Marks & Spencer. With my background in front-end development, full-stack experience, and a passion for delivering innovative solutions, I am excited about the opportunity to contribute to your mission of transforming retail through technology.",
  "applicant": {
    "name": "Jinxu Luo",
    "title": "Full-Stack Developer",
    "email": "luojinxuice@gmail.com",
    "phone": "+447724310483",
    "location": "London"
  },
  "recipient": {
    "name": "Hiring Manager",
    "company": "Marks & Spencer",
    "date": "2025-01-23"
  },
  "projects": [
    {
      "title": "Blockchain-Based Trade Platform",
      "description": "Led the development of a paperless trade solution using React.js and Web3 APIs, securing a 20M CNY government grant."
    },
    {
      "title": "Cloud IDE",
      "description": "Built an online cloud IDE platform using React, TypeScript, and Node.js, integrating intelligent plugins for real-time code completion and debugging while deploying the system on AWS for scalability, streamlining CI/CD pipelines."
    },
    {
      "title": "3D NFT Platform",
      "description": "Designed and deployed a platform with React and Golang, serving over 1,000 clients with a 96% satisfaction rate."
    }
  ],
  "skills": "Marks & Spencer’s commitment to innovation, inclusion, and its global reach aligns with my own professional goals. I am particularly inspired by your focus on leveraging Salesforce Commerce Cloud to deliver exceptional digital experiences in over 60 markets. My adaptability, eagerness to learn, and enthusiasm for new challenges make me confident in my ability to thrive in this role.",
  "missionStatement": "I would welcome the opportunity to bring my technical skills, problem-solving abilities, and collaborative mindset to Marks & Spencer. Thank you for considering my application. I look forward to the possibility of discussing how my experience aligns with your team’s goals.",
  "closing": "Thank you for considering my application. I would welcome the opportunity to discuss how I can contribute to your team."
}