{
  "contactInfo": [
    {
      "title": "Email",
      "value": "luojinxuice@gmail.com",
      "logo": "/email.svg"
    },
    {
      "title": "Phone",
      "value": "+447724310483",
      "logo": "/phone.svg"
    },
    {
      "title": "Location",
      "value": "London, United Kingdom",
      "logo": "/location.svg"
    },
    {
      "title": "LinkedIn",
      "value": "linkedin.com/in/luojinxu",
      "logo": "/linkedin.svg"
    }
  ],
  "introduction": "Full-stack developer with over <b>3 years</b> of experience building scalable web applications using <b>React, Node.js, and TypeScript</b>. Experienced in collaborating with cross-functional teams to deliver high-quality digital products. Passionate about leveraging technology to enhance user engagement and solve complex challenges.",
  "workExperience": [
    {
      "title": "Front-End Developer",
      "company": "Linklogis",
      "location": "Shenzhen, China",
      "date": "09/2020 - 05/2024",
      "description": [
        "<b>Technical Lead:</b>Spearheaded the creation of a paperless trade platform, integrating <b>React.js and Web3 APIs</b> to ensure tamper-proof records, securing a <b>20M CNY </b>grant from the Shenzhen Government.",
        "<b>Product Architect: </b>Designed and implemented a <b>3D NFT</b> platform from scratch using React and Golang, serving over <b>1,000 clients</b> with a<b> 96%</b> satisfaction rate.",
        "<b>Legacy System Modernization:</b> Migrated a legacy system to a <b>Vue 3-based</b> architecture, improving load times by <b>30%</b> and enhancing stability.",
        "<b>AI Integration:</b> Developed an intelligent <b>Q&A chatbot leveraging the ChatGPT API</b>, implemented real-time streaming to enhance user interactions, and scaled the system to support multiple departments, increasing overall productivity.",
        "<b>AWS Experience:</b> Deployed containerized applications using <b>AWS ECS</b> and managed image repositories with <b>AWS ECR</b>, ensuring efficient deployment pipelines. Used AWS <b>S3</b> for basic storage needs, such as handling static assets."
      ]
    }
  ],
  "education": [
    {
      "degree": "Master of Financial Management",
      "school": "Australian National University",
      "location": "Canberra, Australia",
      "date": "07/2018 - 07/2019",
      "coursesAndInfo": [
        "GPA:<b> 5.5/7.0</b>",
        "Key Courses: Applied Investments, Data Analysis, Risk Management"
      ]
    },
    {
      "degree": "Bachelor of Finance",
      "school": "Dalian Finance and Economics College",
      "location": "Dalian, China",
      "date": "09/2014 - 07/2018",
      "coursesAndInfo": [
        "GPA:<b> 3.5/4.0</b>",
        "Key Courses: Database basics, Mathematics and Algorithms, Financial Engineering",
        "<b>National Scholarship</b> (Ranked first in majors)"
      ]
    }
  ],
  "skills": [
    {
      "title": "Frontend",
      "value": "React, Vue, TypeScript, Tailwind CSS, Cypress"
    },
    {
      "title": "Backend",
      "value": "Node.js, Next.js, PostgreSQL, RESTful & GraphQL APIs"
    },
    {
      "title": "DevOps",
      "value": "AWS (Lambda, ECR, ECS), Docker, CI/CD (GitHub Actions)"
    },
    {
      "title": "UI/UX Collaboration",
      "value": "Figma, Wireframing, Prototyping"
    }
  ],
  "projects": [
    {
      "title": "Cloud IDE",
      "technologies": "React, TypeScript, Node.js, AWS",
      "description": [
        "Worked with a cross-functional team to design and implement scalable full-stack applications using <b>Node.js and React.</b>",
        "Enhanced functionality by integrating <b>preset plugins</b> for intelligent code completion, folding, and debugging.",
        "Automated deployment pipelines on <b>AWS</b> using <b>CI/CD (GitHub Actions)</b> and <b>Docker</b>, enabling seamless scalability."
      ]
    },
    {
      "title": "Asset-Backed Tokenization Platform",
      "technologies": "Vue, Typescript, React Native",
      "description": [
         "Designed and implemented a blockchain platform enabling financial asset digitization and trading in secondary markets.",
        "Built front-end interfaces with <b>Vue.js and TypeScript</b>, integrating blockchain data via Web3.js.",
         "Customized <b>React Native</b> wallets to facilitate blockchain interactions, and developed <b>smart contracts</b> to enable asset tokenization."
         ]
    },
    {
          "title": "Cross-Border Paperless Trade Platform",
          "technologies": "React, Solidity, Web3.js",
          "description": [
            "Developed a blockchain-based platform for digitizing cross-border trade documents, ensuring tamper-proof records and transparency.",
            "Designed a renderer using <b>React</b> for seamless user interaction and integrated with Web3.js for blockchain operations.",
            "Integrated Tradetrust and OpenAttestation libraries and utilized <b>smart contract</b> calls to enable secure wrapping, signing, and verification processes."
          ]
      }
  ]
}
